{
  "recipies": [
    {
      "name": "Pannkoogid",
      "author": "Margit",
      "desc": "This is our family classic for Sunday mornings. Sunday without pancakes is just a day. Here is my base recipe, nowadays I add and modify it with ingredients I find at home",
      "inc": [
        {
          "id": 1,
          "incName": "milk",
          "quantity": "2dl"
        },
        {
          "id": 2,
          "incName": "flour",
          "quantity": "2dl"
        },
        {
          "id": 3,
          "incName": "egg",
          "quantity": "2"
        }
      ],
      "inst": "In a medium bowl, whisk together milk and egg. Add dry ingredients to milk mixture; whisk until all is neat. ",
      "img": "https://source.unsplash.com/ZgRTuPsmFQg/1600x900",
      "id": 1,
      "country_code": "EE"
    },
    {
      "name": "Estonian Potato Salad ",
      "author": "Margit",
      "desc": "This salad is loved by Estonians from all walks of life. It’s a true Estonian staple, and one of the country’s most popular foods.",
      "country_code": "EE",
      "inc": [
        {
          "id": 1,
          "incName": "unpeeled potatoes",
          "quantity": "10-15"
        },
        {
          "id": 2,
          "incName": "boiled eggs",
          "quantity": "5-6"
        },
        {
          "id": 3,
          "incName": "fresh cucumbers ",
          "quantity": "1-2"
        },
        {
          "id": 4,
          "incName": "pickled cucumbers",
          "quantity": "4-5 "
        },
        {
          "id": 5,
          "incName": "medium onions",
          "quantity": "2-3"
        },
        {
          "id": 6,
          "incName": "ham or sausage",
          "quantity": "400-500 g"
        },
        {
          "id": 7,
          "incName": "sour cream",
          "quantity": "500ml"
        },
        {
          "id": 8,
          "incName": "mayonnaise",
          "quantity": "500ml "
        },
        {
          "id": 9,
          "incName": "salt and black pepper",
          "quantity": " a fingertip"
        },
        {
          "id": 10,
          "incName": "mustard",
          "quantity": "2 tspoon"
        }
      ],
      "inst": "Boil the potatoes in salted water the day before. Let it cool completely - potatoes cooked in a hurry on the same day do not become a real salad!\n\nTo make a salad, peel boiled potatoes and chop into small cubes. Cut the boiled cooled eggs into small cubes or crush them with a fork. Chop the cucumber into small cubes. Chop the onion or leek very finely (if desired, soak the chopped onion in a little cold water, it will soften the taste). Chop the sausage into small cubes.\n\nThe sauce should be mixed in a separate bowl. Mix sour cream, mayonnaise and mustard. Add chopped dill, onion tops, salt and pepper (the more summertime, the more I add herbs). Pour the sauce over the salad ingredients and mix gently.\n\nBefore serving, let the salad season in the pantry for about 2-4 hours.",
      "img": "https://nami-nami.ee/files/recipes/5240/martiinakartulisalat.JPG",
      "id": 2
    },
    {
      "name": "Garlic Shrimp and Asparagus Risotto",
      "author": "Mariia",
      "desc": "Delicious risotto your whole family will enjoy!",
      "country_code": "IT",
      "inc": [
        {
          "id": 1,
          "incName": "olive oil",
          "quantity": "2 tbsp"
        },
        {
          "id": 2,
          "incName": "onion",
          "quantity": "1/3"
        },
        {
          "id": 3,
          "incName": "clove garlic",
          "quantity": "1/2"
        },
        {
          "id": 4,
          "incName": "raw shrimp",
          "quantity": "450g"
        },
        {
          "id": 5,
          "incName": "asparagus",
          "quantity": "450g"
        },
        {
          "id": 6,
          "incName": "parmesan ",
          "quantity": "1/2 cup"
        },
        {
          "id": 7,
          "incName": "Arborio rice",
          "quantity": "3 cups"
        }
      ],
      "inst": "",
      "img": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets-ucg.meredithcorp.io%2Faa6187d1d3ab16962ac5155d4d6fd72f%2F4517640.jpg&w=596&h=596&c=sc&poi=face&q=60",
      "instructions": "Pour chicken broth into a pot; bring to a simmer over medium-low heat. Heat olive oil in a large saucepan over medium heat. Cook and stir onion and garlic in the hot oil until slightly softened, about 2 minutes. Add Arborio rice; cook, stirring frequently, until coated with oil, about 4 minutes. Stir 1/2 cup of the hot chicken broth into the saucepan; cook and stir until the rice has absorbed the broth, about 2 minutes. Repeat this process 4 more times, stirring constantly, until rice is creamy and tender yet firm to the bite, about 15 minutes. Stir shrimp and asparagus into the remaining hot broth. Cook until shrimp turns pink, 2 to 3 minutes. Remove broth from heat. Stir shrimp and asparagus into the rice; cook for 1 minute. Stir Parmesan cheese and butter into the rice; cook until melted, about 1 minute. Remove rice from heat. Season with salt and pepper. Sprinkle parsley over each serving.",
      "id": 3
    },
    {
      "name": "Pizza",
      "author": "Mariia",
      "desc": "Make perfect pizza at home with this classic homemade pizza recipe, including a pizza dough recipe, topping suggestions, and step-by-step instructions with photos.",
      "country_code": "IT",
      "img": "https://www.simplyrecipes.com/thmb/mbN8mXZ0srgAT1YrDU61183t0uM=/648x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Homemade-Pizza-Dough-Lead-Shot-1b-ea13798d224048b3a28afb0936c9b645.jpg",
      "inc": [
        {
          "id": 1,
          "incName": "cheese",
          "quantity": "1 cup"
        },
        {
          "id": 2,
          "incName": "flour",
          "quantity": "2 cups"
        },
        {
          "id": 3,
          "incName": "milk",
          "quantity": "150 ml"
        }
      ],
      "inst": "",
      "instructions": "Add the flour, salt, sugar, and olive oil, and using the mixing paddle attachment, mix on low speed for a minute. Then replace the mixing paddle with the dough hook attachment.\n\nKnead the pizza dough on low to medium speed using the dough hook about 7-10 minutes.\n\nIf you don't have a mixer, you can mix the ingredients together and knead them by hand.\n\nThe dough should be a little sticky, or tacky to the touch. If it's too wet, sprinkle in a little more flour.",
      "id": 4
    }
  ]
}